# 3. Filtering high-value transactions from a CSV file for targeted promotions.

In [15]:
import pandas as pd

In [16]:
df = pd.read_csv("transaction_data.csv")

In [17]:
df.head()

,transaction_id,customer_id,amount,transaction_date,product_category,payment_method,store_location
0,1,565,2992.47,2025-03-10 01:20:54,Sports,Debit Card,New York
1,2,323,2041.87,2025-01-02 15:24:19,Clothing,Cash,New York
2,3,398,107.35,2025-02-16 03:49:01,Beauty,Debit Card,Online
3,4,19,NaN,2025-04-30 15:26:23,Sports,Debit Card,Los Angeles
4,5,547,3063.28,2025-06-14 04:28:53,Clothing,PayPal,Los Angeles

In [18]:
df['amount'] = df['amount'].fillna(df['amount'].mean())

In [20]:
df.isna().sum()

transaction_id      0
customer_id         0
amount              0
transaction_date    0
product_category    0
payment_method      0
store_location      0
dtype: int64

In [19]:
df.head()

,transaction_id,customer_id,amount,transaction_date,product_category,payment_method,store_location
0,1,565,2992.470000,2025-03-10 01:20:54,Sports,Debit Card,New York
1,2,323,2041.870000,2025-01-02 15:24:19,Clothing,Cash,New York
2,3,398,107.350000,2025-02-16 03:49:01,Beauty,Debit Card,Online
3,4,19,2532.550126,2025-04-30 15:26:23,Sports,Debit Card,Los Angeles
4,5,547,3063.280000,2025-06-14 04:28:53,Clothing,PayPal,Los Angeles

In [22]:
df1=df[df['amount']>df['amount'].mean()]

In [24]:
df2=df[df['amount']>1000]

In [28]:
df1

,transaction_id,customer_id,amount,transaction_date,product_category,payment_method,store_location
0,1,565,2992.47,2025-03-10 01:20:54,Sports,Debit Card,New York
4,5,547,3063.28,2025-06-14 04:28:53,Clothing,PayPal,Los Angeles
6,7,615,3027.38,2025-03-18 15:59:16,Beauty,Credit Card,Chicago
7,8,1,2652.57,2025-04-19 14:46:00,Home,Credit Card,New York
8,9,200,2821.46,2025-01-22 19:12:23,Electronics,PayPal,New York
...,...,...,...,...,...,...,...
987,988,667,2815.32,2025-06-15 20:57:54,Beauty,Cash,Los Angeles
990,991,162,3055.00,2025-04-30 22:46:03,Clothing,Debit Card,Los Angeles
993,994,443,4232.53,2025-02-28 04:00:04,Electronics,Debit Card,Chicago
997,998,669,3069.08,2025-04-01 19:59:01,Home,PayPal,Los Angeles
999,1000,925,4141.44,2025-05-24 13:39:19,Electronics,PayPal,Online

In [27]:
df2

,transaction_id,customer_id,amount,transaction_date,product_category,payment_method,store_location
0,1,565,2992.470000,2025-03-10 01:20:54,Sports,Debit Card,New York
1,2,323,2041.870000,2025-01-02 15:24:19,Clothing,Cash,New York
3,4,19,2532.550126,2025-04-30 15:26:23,Sports,Debit Card,Los Angeles
4,5,547,3063.280000,2025-06-14 04:28:53,Clothing,PayPal,Los Angeles
6,7,615,3027.380000,2025-03-18 15:59:16,Beauty,Credit Card,Chicago
...,...,...,...,...,...,...,...
994,995,927,1368.170000,2025-02-08 21:53:32,Clothing,Cash,Los Angeles
996,997,235,2125.180000,2025-06-09 12:37:36,Electronics,PayPal,Chicago
997,998,669,3069.080000,2025-04-01 19:59:01,Home,PayPal,Los Angeles
998,999,931,2262.750000,2025-06-08 01:36:01,Clothing,Debit Card,Online
999,1000,925,4141.440000,2025-05-24 13:39:19,Electronics,PayPal,Online